In [2]:
import numpy as np
import pandas as pd

A Pandas Series is a one-dimensional labeled array in Python, similar to a list or a column in a DataFrame. It can hold any data type, such as integers, floats, strings, or even Python objects. The key features of a Series are:


Index: Every element in a Series has an associated label, called the index. If you don't provide an index, pandas will use a default integer index starting from 0.


Data: The actual values stored in the Series. These can be of any data type, including numeric, strings, or objects.

**CREATING PANDAS SERIES FROM PYTHON LIST**

In [6]:
li = ["python","javascript","typescript","ruby","R"]
pd.Series(li ) # by default 0 based indexing
pd.Series(li ,index= ["a","b","c","d","e"]) # dtype= object , in most of cases pandas calls string as object , like in this case

a        python
b    javascript
c    typescript
d          ruby
e             R
dtype: object

In [7]:
integers = [1,2,3,4]
pd.Series(integers)

0    1
1    2
2    3
3    4
dtype: int64

In [14]:
marks = [20,30,40,20]
subjects = ["maths","linear algebra","chem" , "dsp"]
pd.Series(marks , index = subjects)

maths             20
linear algebra    30
chem              40
dsp               20
dtype: int64

setting up a name to a series

use name attribute

In [18]:
marks = [20,30,40,20]
subjects = ["calculus","cew","ct" , "cvfa"]
result = pd.Series(marks , index = subjects,name="Jibran k marks",dtype=np.int8)
print(result)

calculus    20
cew         30
ct          40
cvfa        20
Name: Jibran k marks, dtype: int8